// Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.

int a = int.Parse(Console.ReadLine()!);
int b = 7;
int c = 23;

if (a % b %c == 0) {Console.WriteLine ("True");}
else {Console.WriteLine ("False");}
